<?php
/**
 * service 抽象基类
 * @author Dai Zhongwei <daizhongw@gmail.com> 2011-7-10
 * @copyright ©2006-2103 
 * @version $$Id$$
 * @package src
 */
abstract class AbstractFreeServer extends FreeBase
{
		
	public $model;
	
	public function __construct()
    {
		$this->model();
    }
	/**
     +----------------------------------------------------------
     * 设置数据源  所有的server都要重写
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     * @return boolean
     +----------------------------------------------------------
     */
	abstract public function model();

	/**
     +----------------------------------------------------------
     * 获取当前错误
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     * @return boolean
     +----------------------------------------------------------
     */
	public function getError()
	{
		return $this->error;
	}
	/**
     +----------------------------------------------------------
     * 获取当前server的模型
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     * @return boolean
     +----------------------------------------------------------
     */
	public function getModel()
	{
		return $this->model;
	}
}
?>